README.md
```mermaid
sequenceDiagram
    participant c as Client
    participant a as Vorschlaege API
    note over a,c: request financial proposals
    c->>a: POST /vorschlaege
    activate a 
    a->>c: 200 Accepted {anfrageId}
    note over a,c: query financial proposals
    c->>a: GET /vorschlaege/{anfrageId}
    alt determination in progress
      a->>c: 202 Accepted - pls repeat
    else
      a->>c: 200 Ok {financial proposes}
    end
    deactivate a
```
